app/views/welcome/index.html.erb

<div class = "row">
  <% Post.all.each do |post| %>
---
SELECT "posts".* FROM "posts"