app/views/posts/_unlike.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 132], ["LIMIT", 1]]
---
<!-- Created by Yi Implemented by Yi  -->
<%= form_for(current_user.active_like.find_by(post_id: @post.id),
             html: { method: :delete }, remote: true) do |f| %>