app/views/posts/index.html.erb

          <div class="overlay">
            <h2><span class="glyphicon glyphicon-thumbs-up"></span>  <%= post.likes.count %></h2>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 118]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 118]]