app/views/posts/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 118]]
---
      <strong>Likes: </strong>
        <span id="likes"><%= @post.likes.count %></span></p>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <strong>Author: </strong>
        <%= link_to User.find(@post.user_id).name.titleize, user_path(User.find(@post.user_id)) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <div class = "col-md-1">
    <%= link_to "More", user_path(User.find(@post.user_id)), class:"btn btn-primary" , id:"btn-light" %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <div class="thumbnail">
      <%= image_tag User.find(comment.user_id).avatar.url(:small), :class => "img-responsive user-photo" %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <div class="panel-heading">
        <strong><%= User.find(comment.user_id).name.titleize %></strong> <span class="text-muted">commented on <%= comment.created_at %></span>