app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "post_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Hey Havana??"], ["created_at", "2019-07-24 10:53:49.583745"], ["updated_at", "2019-07-24 10:53:49.583745"], ["post_id", "132"], ["user_id", 1]]
INSERT INTO "comments" ("user_name", "body", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["user_name", ""], ["body", ""], ["created_at", "2019-07-23 23:39:49.210279"], ["updated_at", "2019-07-23 23:39:49.210279"], ["post_id", "118"]]
---
  def create
   @comment = Comment.new(params.require(:comment).permit(:body, :post_id))
   @comment.user_id = current_user.id
   @time = @comment.created_at
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", "118"], ["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 118], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comments = Post.find(params[:post_id]).comments
    @comments.find(params[:id]).destroy