app/controllers/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
---
  def create
    @post = Post.find(params[:post_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
---
  def destroy
    @post = Like.find(params[:id]).post