app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user =  User.find(current_user.id)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", "118"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 118], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
---
  def show
@comments = Post.find(params[:id]).comments.all
#Post.find(params[:id]).comments.all
#Post.first.comments
@comment = Post.find(params[:id]).comments.build

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    respond_to do |format|
      if @post.update(post_params)