app/models/user.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 132], ["created_at", "2019-07-24 10:58:23.137850"], ["updated_at", "2019-07-24 10:58:23.137850"]]
---
  def like post
    likes << post

DELETE FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ?  [["user_id", 1], ["post_id", 132]]
---
  def unlike post
    likes.delete post